Revit 2026 API

# CurveUVAs3DCurveInXYPlane Method

---

Returns a 3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Curve As3DCurveInXYPlane()
```
```vb
Public Function As3DCurveInXYPlane As Curve
```
```cpp
public:
Curve^ As3DCurveInXYPlane()
```
```fsharp
member As3DCurveInXYPlane : unit -> Curve
```

#### Return Value

Curve 3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates.

Ideally, this function should only be used in cases when the 2D curve needs to be used in a context that does not support 2D curves, but can represent them as 3D curves with Z = 0 everywhere (for example, converting the 2D curve to another CAD system that does not support 2D curves).

#### Reference

CurveUV Class

Autodesk.Revit.DB Namespace